Revit 2026 API

# ViewSheetGetRevisionNumberOnSheet Method

---

Gets the Revision Number for a particular Revision as it will appear on this sheet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetRevisionNumberOnSheet(
	ElementId revisionId
)
```
```vb
Public Function GetRevisionNumberOnSheet (
	revisionId As ElementId
) As String
```
```cpp
public:
String^ GetRevisionNumberOnSheet(
	ElementId^ revisionId
)
```
```fsharp
member GetRevisionNumberOnSheet :
        revisionId : ElementId -> string
```

#### Parameters

revisionId ElementId
     The id of the Revision.

#### Return Value

String Returns the Revision Number as it will appear on this sheet or  if the Revision does not appear on this sheet.

| Exception | Condition |
| --- | --- |
| ArgumentException | revisionId is not a valid Revision. |
| ArgumentNullException | A non-optional argument was null |

Returns  if the Revision does not appear on this sheet.

#### Reference

ViewSheet Class

Autodesk.Revit.DB Namespace